{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "padding": "same", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_1", "filters": 32, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_2", "filters": 32, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_3", "filters": 32, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_4", "filters": 32, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_5", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "trainable": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_6", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "units": 64, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "units": 64, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_regularizer": null, "units": 1, "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"center": true, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "sigmoid", "trainable": true}}]}